// 회사에 급한 일이 생겨 많은 팀이 회의하게 되었습니다. 하지만 회의실은 1개밖에 없으므로 
// 관리팀은 가능한 많은 팀이 회의할 수 있는 경우를 골라 그 팀들에게 회의실을 빌려주기로 하였습니다. 
// 각 팀은 회의 시작 시각과 종료 시각을 적어 제출하였고, 편의상 한 팀이 회의를 종료하고 나가 
// 다음 팀이 회의를 준비하는 시간은 0으로 가정합니다. 또한, 회의의 시작시간과 끝나는 시간이 같을 수도 있습니다. 
// 각 팀이 제출한 회의 시작 시각과 종료 시각이 arr(배열)로 주어질 때, 회의를 할 수 있는 
// 최대 팀의 개수를 반환하는 solution 함수를 완성하세요.

// 제한사항
// 회의 일정 목록 개수 : 100,000이하의 자연수
// 회의 시작 시각(S), 종료 시각(E) 범위 : 0 <= S <= E <= 20,000,000

// 입출력 예
// arr	result
// [[1, 2], [2, 4], [2, 2]]	3
// [[1, 4], [2, 6], [4, 7]]	2
// 입출력 예 설명
// 입출력 예 #1
// 1번째 팀이 회의를 시작하고, 회의가 끝나자마자 3번째 팀의 회의가 가능합니다. 또한, 
// 3번째 팀의 회의가 끝나자마자 2번째 팀의 회의가 가능합니다. 이 경우가 최대이므로 3을 반환해 주면 됩니다.
// 입출력 예 #2
// 1번째 팀이 회의를 시작하고, 회의가 끝나자마자 3번째 팀의 회의가 가능합니다. 이 경우가 최대이므로 2를 반환해 주면 됩니다.

const solution = (arr) => {
    let count = 0;
    let n = 0;
    const arrSort = arr.sort((a, b) => a[1] - b[1]);
    for (let i = 0; i < arrSort.length; i++) {
        if (n <= arrSort[i][0]) {
            n = arrSort[i][1];
            ++count;
        }
    }

    return count;
}

module.exports = solution;